wjcloudy/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* Runtime wheel base (centre-to-centre track) used by the differential-drive
 * inverse kinematics. Seeded with the board.h/template WHEEL_BASE, then set from
 * fw_params (FW_PARAM_WHEEL_BASE).
 * The runtime max-speed cap lives in drivemotor.c (g_max_mps / DRIVEMOTOR_*MaxMps)
 * because it is also consumed there for the anti-dig frame ceiling. */
static volatile float g_wheel_base = (float)WHEEL_BASE;

/* ---------------------------------------------------------------------------
 * Gyro-local closed yaw-rate loop (Option C).
 *
 * The per-wheel PIs below regulate each wheel's SPEED independently, so the
 * chassis yaw rate was only their emergent difference — on soft/uneven turf the
 * actual yaw lagged/overshot the commanded wz (the weave). This loop closes a
 * real regulator on (commanded wz − measured gyro wz) at the 50 Hz motor
 * cadence and injects the correction as a SYMMETRIC differential velocity trim
 * (+right / −left), i.e. it rotates the robot WITHOUT changing mean forward
 * speed. Consequences of "symmetric": it never fights the host-side
 * anti-wheelspin forward-speed easing (that only scales vx), and it only shifts
 * the per-wheel PI setpoints (their deadband-bridging integrators still run).
 *
 * SAFETY: firmware stays the sole blade authority; this loop only shapes drive.
 * Fail-safe by construction — on gyro read failure, hard_stop, or disable, the
 * trim is 0 and the yaw integrator is reset, degrading to today's open-diff
 * behaviour. The trim is hard-clamped to ±g_yaw_trim_limit_mps (also the PID
 * output limit), so even a wrong gyro_sign (positive feedback) can only add a
 * bounded differential the per-wheel loops still cap at ±MAX_MPS — a bounded
 * veer, never an unbounded spin. Gains/sign/enable are runtime-tunable via
 * PKT_ID_SET_YAW_PID. */
/* Power-on gains/limit: drive_tuning_defaults.h (YAW_PI_*_DEFAULT). */
/* Integral term is clamped TIGHTER than the total trim (leaves headroom for the
 * P term and limits integral-driven overshoot/hunting). */
#define YAW_INT_LIMIT_FRAC 0.60f
/* Turn-exit anti-windup (task #37): when |commanded wz| falls from clearly
 * turning (> HI) to nearly straight (< LO) in one step, dump the integrator so
 * the wind-up built up through a U-turn doesn't drive a lingering differential
 * on the straight that follows (the reported post-U-turn wiggle). */
#define YAW_TURN_EXIT_HI_RADPS 0.40f
#define YAW_TURN_EXIT_LO_RADPS 0.15f
/* Low-speed authority scaling (task #37): below REF forward speed the yaw
 * correction (trim + a per-cycle integral leak) is scaled toward FLOOR so the
 * loop doesn't hunt on gyro noise when nearly stopped at the dock. The base
 * rotation still comes from the IK feedforward (snap targets), so an in-place
 * PRE_ROTATE pivot — commanded vx≈0 — is unaffected; only the closed-loop
 * correction is de-rated. On straights (vx ≥ REF) the scale is 1.0, so the
 * working straight-line weave rejection is untouched. */
#define YAW_LOWSPEED_REF_MPS 0.15f
#define YAW_LOWSPEED_FLOOR 0.25f
#define YAW_INT_LEAK_AT_FLOOR 0.90f /* per-cycle integral retain factor at FLOOR authority */
/* Anti-self-oscillation (task #39): the loop was self-exciting a ~2-4 Hz yaw
 * limit-cycle against the wheel deadband/stiction while the command was smooth
 * (~0.15 Hz). Two damping terms, both only REDUCE aggressiveness:
 *  - 1st-order IIR low-pass on the gyro feedback: alpha = dt / (RC + dt). At the
 *    50 Hz (dt=20 ms) motor rate, alpha=0.30 → RC≈47 ms → cutoff ≈ 3.4 Hz: it
 *    attenuates the 2-4 Hz self-oscillation the loop was chasing while adding
 *    little phase lag at the ~0.15 Hz of a real turn.
 *  - Slew-rate limit on the injected trim: caps |Δtrim| per 20 ms cycle so the
 *    output can't snap across the wheel deadband and re-excite the cycle. At
 *    0.03 m/s/cycle, full-scale (±0.15) takes ~5 cycles (100 ms) — invisible to a
 *    0.15 Hz command, fatal to a 2-4 Hz one. */
#define YAW_GYRO_LP_ALPHA 0.30f
#define YAW_TRIM_SLEW_MPS_PER_CYCLE 0.03f
static PID yaw_pid;
static float prev_yaw_trim_mps = 0.0f;
static float prev_applied_yaw_trim_mps = 0.0f; /* last trim actually injected (slew-limit state) */
static float yaw_gyro_filt = 0.0f;             /* low-passed gyro yaw rate [rad/s] */
static uint8_t yaw_gyro_filt_valid = 0u;       /* 0 until the IIR is seeded after a reset */
static float prev_cmd_wz = 0.0f;
static volatile float cmd_wz = 0.0f; /* commanded yaw rate [rad/s], set by on_cmd_vel */
static volatile uint8_t g_yaw_loop_enabled = 1;   /* default on for A/B */
static volatile float g_yaw_gyro_sign = 1.0f;     /* gyro Z sign vs robot +yaw */
static volatile float g_yaw_trim_limit_mps = YAW_TRIM_LIMIT_MPS_DEFAULT;
/* Host-measured mean at-rest gyro-Z bias [rad/s], raw sensor frame. Subtracted
 * before the sign multiply so open-loop moves (BackUp) hold a true straight line
 * instead of tracing the bias as an arc. 0 until the host sends it
 * (FW_PARAM_YAW_GYRO_BIAS_RADPS, never persisted: re-measured on every dock). */
static volatile float g_yaw_gyro_bias = 0.0f;

/* ---------------------------------------------------------------------------
 * Blade motor control state
 * ---------------------------------------------------------------------------*/
static volatile uint8_t target_blade_on_off = 0;
static volatile uint32_t target_blade_emergency_generation = 0;
static uint8_t blade_on_off = 0;
static uint8_t blade_direction = 0;

/* ---------------------------------------------------------------------------
 * cmd_vel timeout tracking (replaces ros::Time)
 * ---------------------------------------------------------------------------*/
static volatile uint32_t last_cmd_vel_tick = 0;

/* ---------------------------------------------------------------------------
 * High-level state received from host
 * ---------------------------------------------------------------------------*/
static uint8_t hl_current_mode = 0;
static uint8_t hl_gps_quality = 0;

/* ---------------------------------------------------------------------------
 * Heartbeat watchdog
 * ---------------------------------------------------------------------------*/
static volatile uint32_t last_heartbeat_tick = 0;
#define HEARTBEAT_TIMEOUT_MS 2000u

/* True when the CURRENTLY latched emergency was raised SOLELY by the heartbeat
 * watchdog (host comms lost), with no physical safety sensor asserted. A pure
 * comms-loss latch is a fail-safe stop, not a physical hazard, so it is
 * auto-cleared when heartbeats resume (and no sensor is asserted) instead of
 * stranding the robot until a manual play-button / GUI reset. A physical
 * trigger (e-stop button, lift, tilt) clears this flag so its latch still
 * requires an explicit operator release. The blade stays cut throughout — it
 * only re-arms on an explicit CMD_BLADE after the emergency clears. */
static volatile bool heartbeat_only_latch = false;

/* Any physical safety sensor currently asserted? Firmware is the sole safety
 * authority; this gates every automatic emergency clear. */
static inline bool any_physical_emergency(void) {
  return Emergency_StopButtonYellow() || Emergency_StopButtonWhite() ||
         Emergency_WheelLiftBlue() || Emergency_WheelLiftRed() ||
         Emergency_Tilt() || Emergency_LowZAccelerometer();
}

/* ---------------------------------------------------------------------------
 * Reboot flag
 * ---------------------------------------------------------------------------*/
static bool reboot_flag = false;

/* ---------------------------------------------------------------------------
 * Non-blocking timers
 * ---------------------------------------------------------------------------*/
static nbt_t motors_nbt;
static nbt_t panel_nbt;
static nbt_t imu_nbt;
static nbt_t status_nbt;
static nbt_t led_nbt;
static nbt_t blade_nbt;

/* ---------------------------------------------------------------------------
 * Odometry timing
 * ---------------------------------------------------------------------------*/
static uint32_t last_odom_tick = 0;

