wjcloudy/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* Forward declarations */
static void update_blade_led(void);

/* ---------------------------------------------------------------------------
 * Broadcast backpressure helpers
 * ---------------------------------------------------------------------------*/
static inline bool nbt_due(const nbt_t *nbt, const uint32_t now_tick) {
  return (now_tick - nbt->previousMillis) > nbt->timeout;
}

static inline void nbt_consume(nbt_t *nbt, const uint32_t now_tick) {
  nbt->previousMillis = now_tick;
}

static inline uint32_t usb_cdc_framed_packet_size(const size_t raw_packet_size) {
  /* All current packets are far below 254 bytes, so COBS adds at most one
   * overhead byte. Framed wire size = leading 0x00 + encoded payload + trailing
   * 0x00 <= raw + 3. */
  return (uint32_t)raw_packet_size + 3u;
}

static inline bool usb_cdc_can_queue_bytes(const uint32_t wire_bytes) {
  return CDC_TXQueue_GetWriteAvailable() >= wire_bytes;
}

static inline bool usb_cdc_should_send_telemetry_packet(
    const uint32_t wire_bytes) {
  if (!CDC_ShouldSendTelemetry()) {
    return false;
  }

  if (!usb_cdc_can_queue_bytes(wire_bytes)) {
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_TX_QUEUE_FULL);
    return false;
  }

  return true;
}

/* ---------------------------------------------------------------------------
 * COBS packet handlers (Host -> Firmware)
 * ---------------------------------------------------------------------------*/

static void on_heartbeat(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_heartbeat_t) - 2u) {
    return;
  }

  const pkt_heartbeat_t *pkt = reinterpret_cast<const pkt_heartbeat_t *>(data);

  last_heartbeat_tick = HAL_GetTick();

  const bool emergency_requested = pkt->emergency_requested != 0u;
  const bool emergency_release_requested =
      pkt->emergency_release_requested != 0u;
  const bool watchdog_latch_active =
      heartbeat_only_latch && Emergency_State() == 1u;
  /* A STOP request needs no sensor read: it always wins. This preserves the
   * previous sensor-read conditions for all other inputs. */
  const bool physical_emergency =
      !emergency_requested &&
      (watchdog_latch_active || emergency_release_requested) &&
      any_physical_emergency();
  const HeartbeatEmergencyDecision decision = decide_heartbeat_emergency(
      emergency_requested, emergency_release_requested, physical_emergency,
      watchdog_latch_active);

  switch (decision.action) {
    case HeartbeatEmergencyAction::Assert:
      Emergency_SetState(1);
      break;
    case HeartbeatEmergencyAction::Release:
      Emergency_SetState(0);
      break;
    case HeartbeatEmergencyAction::AutoClearWatchdog:
      Emergency_SetState(0);
      debug_printf("heartbeat resumed: comms-loss emergency auto-cleared\r\n");
      break;
    case HeartbeatEmergencyAction::Unchanged:
      break;
  }

  if (decision.clear_heartbeat_only_latch) {
    heartbeat_only_latch = false;
  }

  if (emergency_release_requested && !emergency_requested &&
      physical_emergency) {
    debug_printf("emergency release rejected: physical sensor still active\r\n");
  }
}

static void on_cmd_vel(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_cmd_vel_t) - 2u) {
    return;
  }

  const pkt_cmd_vel_t *pkt = reinterpret_cast<const pkt_cmd_vel_t *>(data);

  const float vx = pkt->linear_x;
  const float wz = pkt->angular_z;

  /* Firmware is the final safety authority.  Validate before refreshing the
   * watchdog: NaN defeats ordinary >/< clamps, and an invalid packet must
   * never preserve or refresh a motion target.  Clear all command state so a
   * malformed packet deterministically stops the next motor cycle. */
  mowgli_cmd_vel::SafetyState safety_state{
      cmd_wz, left_target_mps, right_target_mps, last_cmd_vel_tick};
  if (!mowgli_cmd_vel::apply_safety(vx, wz, HAL_GetTick(), safety_state)) {
    cmd_wz = safety_state.cmd_wz;
    left_target_mps = safety_state.left_target_mps;
    right_target_mps = safety_state.right_target_mps;
    return;
  }

  /* Only a validated command is a new cmd_vel heartbeat. */
  last_cmd_vel_tick = safety_state.last_valid_tick;

  if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
    return;
  }

  /* Commanded yaw rate for the firmware yaw-rate loop (Option C), read in the
   * motor timebase by motors_handler. Stored raw (pre-IK) so the loop tracks
   * the operator/Nav2 intent, not the clamped per-wheel reconstruction. */
  cmd_wz = wz;

  /* Differential-drive inverse kinematics — per-wheel linear speed. Wheel base
   * and the ±cap are runtime values (PKT_ID_SET_KINEMATICS); the compile-time
   * WHEEL_BASE/MAX_MPS remain the power-on fallback. The cap can only be lowered
   * below the compiled MAX_MPS ceiling (DRIVEMOTOR_GetMaxMps clamps it). */
  const float wheel_base = g_wheel_base;
  const float max_mps = DRIVEMOTOR_GetMaxMps();
  float left_mps = vx - wz * wheel_base * 0.5f;
  float right_mps = vx + wz * wheel_base * 0.5f;

  if (left_mps > max_mps)
    left_mps = max_mps;
  if (left_mps < -max_mps)
    left_mps = -max_mps;
  if (right_mps > max_mps)
    right_mps = max_mps;
  if (right_mps < -max_mps)
    right_mps = -max_mps;

  /* Hand the target wheel velocities to the PI loop in motors_handler.
   * The mapping to PWM (feedforward + closed-loop correction) lives
   * there now so the integrator can bridge the static-friction
   * deadband on sub-deadband commands. */
  left_target_mps = left_mps;
  right_target_mps = right_mps;
}

/* ---------------------------------------------------------------------------
 * Runtime parameters (protocol v7). Handlers run in USB RX interrupt context:
 * they only store the coerced value (fw_params_set). The subsystems are updated
 * from the main loop by apply_param_groups(), one group at a time, so no loop
 * ever sees a half-applied set.
 * ---------------------------------------------------------------------------*/
static void on_set_param(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_set_param_t) - 2u) {
    return;
  }
  pkt_set_param_t pkt;
  memcpy(&pkt, data, sizeof(pkt) - 2u);
  (void)fw_params_set(pkt.param_id, pkt.value);
}

static void on_get_param(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_get_param_t) - 2u) {
    return;
  }
  pkt_get_param_t pkt;
  memcpy(&pkt, data, sizeof(pkt) - 2u);
  fw_params_request_report(pkt.param_id);
}

static void on_param_commit(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_param_commit_t) - 2u) {
    return;
  }
  if (data[1] == PKT_PARAM_COMMIT_MAGIC) {
    fw_params_request_commit();
  }
}

