wjcloudy/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* Per-wheel velocity PI + encoder scale + feedforward. Both wheels share the
 * gains; the output limit stays 255 PWM (motor controller max) and is
 * re-asserted so it never depends on init order (the PX4 PID default-inits
 * _limit_output to 0). */
static void apply_drive_params() {
  const float kp = fw_params_get(FW_PARAM_WHEEL_KP);
  const float ki = fw_params_get(FW_PARAM_WHEEL_KI);
  const float kd = fw_params_get(FW_PARAM_WHEEL_KD);
  const float ilim = fw_params_get(FW_PARAM_WHEEL_INTEGRAL_LIMIT);
  left_wheel_pid.setGains(kp, ki, kd);
  left_wheel_pid.setIntegralLimit(ilim);
  left_wheel_pid.setOutputLimit(255.0f);
  right_wheel_pid.setGains(kp, ki, kd);
  right_wheel_pid.setIntegralLimit(ilim);
  right_wheel_pid.setOutputLimit(255.0f);
  DRIVEMOTOR_SetTicksPerMeter(fw_params_get(FW_PARAM_TICKS_PER_METER));
  g_pwm_per_mps = fw_params_get(FW_PARAM_PWM_PER_MPS);
}

/* Gyro yaw-rate loop. The trim limit is also capped to the live speed cap,
 * and the integral limit is pinned below it so the integrator alone can never
 * exceed the differential clamp. */
static void apply_yaw_params() {
  const float tl = pid_constrain(fw_params_get(FW_PARAM_YAW_TRIM_LIMIT_MPS), 0.0f,
                                 DRIVEMOTOR_GetMaxMps());
  yaw_pid.setGains(fw_params_get(FW_PARAM_YAW_KP), fw_params_get(FW_PARAM_YAW_KI), 0.0f);
  yaw_pid.setIntegralLimit(tl * YAW_INT_LIMIT_FRAC);
  yaw_pid.setOutputLimit(tl);
  g_yaw_trim_limit_mps = tl;
  g_yaw_gyro_sign = fw_params_get(FW_PARAM_YAW_GYRO_SIGN) < 0.0f ? -1.0f : 1.0f;
  g_yaw_gyro_bias = fw_params_get(FW_PARAM_YAW_GYRO_BIAS_RADPS);
  g_yaw_loop_enabled = fw_params_get(FW_PARAM_YAW_LOOP_ENABLED) != 0.0f ? 1u : 0u;
}

static void apply_kinematics_params() {
  /* on_cmd_vel (USB interrupt) reads both: update them together. */
  __disable_irq();
  DRIVEMOTOR_SetMaxMps(fw_params_get(FW_PARAM_MAX_MPS));
  g_wheel_base = fw_params_get(FW_PARAM_WHEEL_BASE);
  __enable_irq();
}

static void apply_charge_params() {
  charger_set_charge_limits(fw_params_get(FW_PARAM_MAX_CHARGE_VOLTAGE),
                            fw_params_get(FW_PARAM_MAX_CHARGE_CURRENT));
}

static void apply_emergency_params() {
  emergency_set_timeouts((uint32_t)fw_params_get(FW_PARAM_ONE_WHEEL_LIFT_MS),
                         (uint32_t)fw_params_get(FW_PARAM_BOTH_WHEELS_LIFT_MS),
                         (uint32_t)fw_params_get(FW_PARAM_TILT_MS),
                         (uint32_t)fw_params_get(FW_PARAM_STOP_BUTTON_MS),
                         (uint32_t)fw_params_get(FW_PARAM_PLAY_CLEAR_MS));
}

static void apply_imu_params() {
  /* Queued: I2C_Onboard_Service rewrites the LIS3DH register from its own
   * state machine, never mid-transaction. */
  I2C_Onboard_SetInclinationThreshold(
      (uint8_t)fw_params_get(FW_PARAM_IMU_INCLINATION_THRESHOLD));
}

static void apply_param_groups(uint32_t groups) {
  if (groups & (1u << FW_PARAM_GROUP_DRIVE)) {
    apply_drive_params();
  }
  if (groups & (1u << FW_PARAM_GROUP_KINEMATICS)) {
    apply_kinematics_params();
  }
  /* The yaw trim is capped by max_mps: re-apply it when the cap moves. */
  if (groups & ((1u << FW_PARAM_GROUP_YAW) | (1u << FW_PARAM_GROUP_KINEMATICS))) {
    apply_yaw_params();
  }
  if (groups & (1u << FW_PARAM_GROUP_CHARGE)) {
    apply_charge_params();
  }
  if (groups & (1u << FW_PARAM_GROUP_EMERGENCY)) {
    apply_emergency_params();
  }
  if (groups & (1u << FW_PARAM_GROUP_IMU)) {
    apply_imu_params();
  }
}

static void on_hl_state(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_hl_state_t) - 2u) {
    return;
  }

  const pkt_hl_state_t *pkt = reinterpret_cast<const pkt_hl_state_t *>(data);

  hl_current_mode = pkt->current_mode;
  hl_gps_quality = pkt->gps_quality;

  // Update panel LEDs based on mode
  if (hl_gps_quality < 90) {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_OFF);
  } else {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_ON);
  }

  // Map host mode to internal status for motor safety.
  // Constants defined in mowgli_protocol.h — keep in sync with
  // HighLevelStatus.msg.
  switch (hl_current_mode) {
  case HL_MODE_AUTONOMOUS:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_RECORDING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_RECORD;
    break;
  case HL_MODE_MANUAL_MOWING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_NULL:
  case HL_MODE_IDLE:
  default:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;
    left_target_mps = right_target_mps = 0.0f;
    cmd_wz = 0.0f;
    blade_on_off = target_blade_on_off = 0;
    target_blade_emergency_generation = Emergency_Generation();
    break;
  }

  update_blade_led();
}

static void on_cmd_blade(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_cmd_blade_t) - 2u) {
    return;
  }

  const pkt_cmd_blade_t *pkt = reinterpret_cast<const pkt_cmd_blade_t *>(data);
  /* Bind each explicit request to the emergency generation it followed.
   * Commands received during an emergency are rejected by the shared policy. */
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  const uint32_t emergency_generation = Emergency_Generation();
  const bool emergency_active = Emergency_State() != 0u;
  const BladeIntentDecision decision = decide_blade_intent(
      target_blade_on_off, target_blade_emergency_generation, true,
      pkt->blade_on, emergency_generation,
      main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE, emergency_active,
      emergency_generation);
  target_blade_on_off = decision.retained_request;
  target_blade_emergency_generation = decision.request_generation;
  blade_direction = pkt->blade_dir;
  __set_PRIMASK(primask);
}

/* Host -> Firmware reboot request. Sets reboot_flag so chatter_handler issues
 * NVIC_SystemReset on its next tick (lets the current packet/ISR unwind first).
 * Gated on the magic byte so a corrupt/misframed packet can't reset the board.
 */
static void on_reboot(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_reboot_t) - 2u) {
    return;
  }
  const pkt_reboot_t *pkt = reinterpret_cast<const pkt_reboot_t *>(data);
  if (pkt->magic == PKT_REBOOT_MAGIC) {
    debug_printf("reboot requested by host\r\n");
    reboot_flag = true;
  }
}

/* Host -> Firmware config/version request. Replies with this firmware's
 * wire-protocol version (the compatibility key the host checks) and its
 * human-readable semver, so the ROS 2 image can confirm it is talking to a
 * compatible firmware and warn the operator to reflash on mismatch. Firmware
 * older than this handshake never registers this handler, so it simply never
 * replies — which the host reads as "incompatible firmware". */
static void on_config_req(const uint8_t *data, size_t len) {
  if (len < 1u) {
    return;
  }
  const uint8_t flags = (len >= 2u) ? data[1] : 0u;
  g_firmware_debug_enabled = (flags & CONFIG_FLAG_FIRMWARE_DEBUG) != 0u ? 1u : 0u;

  pkt_config_rsp_t rsp;
  rsp.type = PKT_ID_CONFIG_RSP;
  rsp.protocol_version = MOWGLI_PROTOCOL_VERSION;
  rsp.active_flags = g_firmware_debug_enabled != 0u ? CONFIG_FLAG_FIRMWARE_DEBUG : 0u;
  rsp.fw_version_major = MOWGLI_FW_VERSION_MAJOR;
  rsp.fw_version_minor = MOWGLI_FW_VERSION_MINOR;
  rsp.fw_version_patch = MOWGLI_FW_VERSION_PATCH;
  mowgli_comms_send(&rsp, sizeof(rsp));
}

