wjcloudy/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* on_hl_state blade LED feedback (moved out of on_hl_state for clarity) */
static void update_blade_led(void) {
  if (target_blade_on_off) {
#ifdef PANEL_LED_2H
    if (BLADEMOTOR_bActivated) {
      PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_FLASH_SLOW);
    } else {
      PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_ON);
    }
#endif
  } else {
#ifdef PANEL_LED_2H
    PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_OFF);
#endif
  }
}

/* ---------------------------------------------------------------------------
 * USB CDC receive callback — feeds COBS layer
 * ---------------------------------------------------------------------------*/
uint8_t CDC_DataReceivedHandler(const uint8_t *Buf, uint32_t len) {
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_RX_PROCESS);
  mowgli_comms_process_rx(Buf, (size_t)len);
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_RX_EXIT);
  return CDC_RX_DATA_HANDLED;
}

/* ---------------------------------------------------------------------------
 * usb_cdc_transmit — required by mowgli_comms.c
 * ---------------------------------------------------------------------------*/
void usb_cdc_transmit(const uint8_t *buf, size_t len) {
  CDC_Transmit(buf, (uint32_t)len);
}

/* ---------------------------------------------------------------------------
 * LED blink + reboot handler (replaces chatter_handler)
 * ---------------------------------------------------------------------------*/
extern "C" void chatter_handler() {
  if (NBT_handler(&led_nbt)) {
    HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);

    if (reboot_flag) {
      NVIC_SystemReset();
    }
  }
}

/* Anti-dig per-wheel step (task #46). Returns true when the wheel must be cut
 * (caller forces PWM 0 + resets that wheel's integrator). Over each window it
 * accumulates BOTH the actual travel (|dticks|) AND the travel the commanded
 * speed implies (|target| × ticks_per_meter × dt); at window end it latches iff
 * the wheel kept less than PROGRESS_FRACTION of that commanded travel while
 * pushing. Comparing to the *command* (not a fixed distance) means a wheel that
 * keeps up with its setpoint — fast or slow, light or heavy load — is never
 * flagged, while a wheel PLOWING at a small fraction of its command latches
 * even if its absolute creep is non-trivial (the loophole in the old fixed-
 * 0.03 m floor, which reset forever on any creep above it). Clears the latch
 * the instant the command drops below MIN_TARGET.
 *
 * MANUAL FIELD TEST (supervised, 2026-07-21 — no host test harness for this
 * TU): 1) On turf, command a straight drive into a fixed obstacle (wall/post)
 * so both wheels stall while cmd_vel keeps requesting ~0.15 m/s. Expect BOTH
 * wheels to cut within ~WINDOW_MS (~1.5 s) — verify no continued grinding.
 * 2) Back off; confirm the latch clears (wheels drive again) once cmd_vel
 * returns to ~0. 3) Regression: a full normal mow + a slow dock approach must
 * NOT trip the latch (heavy grass load and slope climbing keep >30% of the
 * commanded travel). 4) Half-block ONE wheel (e.g. against a low kerb) and
 * confirm only that wheel latches. */
static bool antidig_step(uint32_t *stall_ms, int32_t *stall_ticks,
                         float *exp_ticks, bool *latched, float target,
                         int16_t pwm, int32_t dticks, float ticks_per_meter) {
  const bool commanded = fabsf(target) > ANTIDIG_MIN_TARGET_MPS;
  if (!commanded) {
    *stall_ms = 0u;
    *stall_ticks = 0;
    *exp_ticks = 0.0f;
    *latched = false;
    return false;
  }
  if (*latched) {
    return true; /* hold until the command clears (handled above) */
  }
  const bool pushing = (pwm > ANTIDIG_MIN_ABS_PWM) || (pwm < -ANTIDIG_MIN_ABS_PWM);
  if (!pushing) {
    *stall_ms = 0u;
    *stall_ticks = 0;
    *exp_ticks = 0.0f;
    return false;
  }
  *stall_ms += MOTORS_NBT_TIME_MS;
  *stall_ticks += (dticks < 0) ? -dticks : dticks;
  *exp_ticks += fabsf(target) * ticks_per_meter * WHEEL_PI_DT_S;
  if (*stall_ms >= ANTIDIG_WINDOW_MS) {
    if ((float)(*stall_ticks) < ANTIDIG_PROGRESS_FRACTION * (*exp_ticks)) {
      *latched = true; /* pushed the whole window, kept <30% of commanded travel → dig */
    } else {
      *stall_ms = 0u; /* keeping up with the command — reset the window */
      *stall_ticks = 0;
      *exp_ticks = 0.0f;
    }
  }
  return *latched;
}

/* ---------------------------------------------------------------------------
 * Drive & blade motors handler
 * ---------------------------------------------------------------------------*/
extern "C" void motors_handler() {
  if (NBT_handler(&motors_nbt)) {
    /* Snapshot ISR-written variables under interrupt lock */
    __disable_irq();
    float snap_left_target = left_target_mps;
    float snap_right_target = right_target_mps;
    float snap_cmd_wz = cmd_wz;
    uint8_t snap_target_blade = target_blade_on_off;
    uint32_t snap_blade_generation = target_blade_emergency_generation;
    uint32_t snap_cmd_vel = last_cmd_vel_tick;
    float snap_ticks_per_meter = DRIVEMOTOR_GetTicksPerMeter();
    uint32_t snap_emergency_generation = Emergency_Generation();
    bool emergency_active = Emergency_State() != 0u;
    bool idle = main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE;
    __enable_irq();

    /* Emergency and IDLE gates discard retained blade intent as well as
     * forcing the output OFF, so clearing a gate cannot revive an older
     * enable request. */
    const BladeIntentDecision blade_decision = decide_blade_intent(
        snap_target_blade, snap_blade_generation, false, 0u,
        snap_emergency_generation, idle, emergency_active,
        snap_emergency_generation);
    blade_on_off = blade_decision.effective_output;
    if (blade_decision.retained_request != snap_target_blade ||
        blade_decision.request_generation != snap_blade_generation) {
      const uint32_t primask = __get_PRIMASK();
      __disable_irq();
      const uint32_t current_generation = Emergency_Generation();
      const bool emergency_active_now = Emergency_State() != 0u;
      const bool idle_now = main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE;
      if (target_blade_on_off != 0u &&
          (emergency_active_now || idle_now ||
           target_blade_emergency_generation != current_generation)) {
        target_blade_on_off = 0;
        target_blade_emergency_generation = current_generation;
      }
      __set_PRIMASK(primask);
    }

