wjcloudy/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
    /* --- decide effective drive target ---
     * Emergency or cmd_vel watchdog timeout overrides the drive output. */
    bool hard_stop = false;
    if (emergency_active) {
      hard_stop = true;
    } else if (idle) {
      /* Re-assert the IDLE gate HERE — in the one place that actually
       * drives the wheels AND the blade — so the "never move / never
       * spin the blade while idle/docked" guarantee holds regardless of
       * the relative arrival order of CMD_PWM, CMD_BLADE and HL_STATE.
       * on_hl_state zeroes the targets when the IDLE packet arrives, but
       * a CMD_BLADE(on=1) arriving AFTER it would otherwise re-arm the
       * blade with no gate (on_cmd_blade is fire-and-forget). Firmware is
       * the sole blade safety authority. */
      hard_stop = true;
      blade_on_off = 0;
    } else {
      const uint32_t cmd_vel_age_ms = HAL_GetTick() - snap_cmd_vel;
      if (cmd_vel_age_ms > 200u) {
        /* Command-vel watchdog: zero motors if the host hasn't
         * sent a twist in 200 ms (Pi hang, USB glitch, etc). */
        hard_stop = true;
      }
      if (cmd_vel_age_ms > 25000u) {
        blade_on_off = 0;
      }
    }

    /* --- Option C: gyro-local closed yaw-rate loop ---
     * Regulate (commanded wz − measured gyro wz) and fold the output in as a
     * symmetric differential velocity trim on the per-wheel setpoints (below).
     * Runs before the per-wheel PIs so their integrators track the trimmed
     * setpoint. See the block comment at the yaw-loop globals for rationale and
     * the bounded-failure argument. */
    float yaw_trim_mps = 0.0f;
    const bool yaw_loop_active = (g_yaw_loop_enabled != 0u) && !hard_stop;
    /* Reset the yaw integrator on stop / yaw-direction reversal (mirrors the
     * per-wheel resets) AND at turn-exit — a sharp drop in |commanded wz| from
     * turning to straight (task #37). Dumping the wind-up here is what kills the
     * reported post-U-turn wiggle: without it the integral accumulated while
     * holding the turn keeps driving a differential onto the following straight. */
    const bool yaw_turn_exit = (fabsf(prev_cmd_wz) > YAW_TURN_EXIT_HI_RADPS &&
                                fabsf(snap_cmd_wz) < YAW_TURN_EXIT_LO_RADPS);
    const bool yaw_reset = !yaw_loop_active ||
                           (snap_cmd_wz == 0.0f && prev_cmd_wz != 0.0f) ||
                           (snap_cmd_wz * prev_cmd_wz < 0.0f) || yaw_turn_exit;
    if (yaw_reset) {
      yaw_pid.resetIntegral();
      yaw_pid.resetDerivative();
      yaw_gyro_filt_valid = 0u; /* re-seed the gyro low-pass after a reset */
    }
    prev_cmd_wz = snap_cmd_wz;

    /* Low-speed authority scale from COMMANDED mean forward speed: 1.0 at/above
     * REF, ramping down to FLOOR as vx→0. Uses the commanded (not measured)
     * speed so a momentary stall doesn't collapse authority, and so an in-place
     * pivot (vx≈0) is de-rated to FLOOR rather than zeroed — the pivot itself
     * still comes from the IK feedforward. On straights this is 1.0, leaving the
     * (working) weave rejection untouched. */
    const float yaw_vx_cmd = 0.5f * (snap_left_target + snap_right_target);
    float yaw_speed_scale = fabsf(yaw_vx_cmd) / YAW_LOWSPEED_REF_MPS;
    if (yaw_speed_scale > 1.0f)
      yaw_speed_scale = 1.0f;
    yaw_speed_scale =
        YAW_LOWSPEED_FLOOR + (1.0f - YAW_LOWSPEED_FLOOR) * yaw_speed_scale;

    if (yaw_loop_active) {
      float gx = 0.0f, gy = 0.0f, gz = 0.0f;
      /* Fresh gyro read in the motor timebase. On I2C failure hold trim at 0
       * (degrade to open-diff) rather than injecting a stale/bogus correction.
       * Both this and the IMU broadcast read run in the cooperative main loop,
       * so there is no re-entrancy on the software-I2C bus. */
      if (IMU_TryReadGyro(&gx, &gy, &gz)) {
        /* Subtract the host-measured at-rest gyro-Z bias BEFORE the sign
         * multiply — meas = sign*(gz - bias) — so nulling the loop drives the
         * TRUE yaw rate to the setpoint. Without this, an open-loop BackUp
         * (wz=0) would hold sign*gz=0, i.e. true_rate=-bias, a constant arc. */
        const float meas_wz_raw =
            g_yaw_gyro_sign * (gz - g_yaw_gyro_bias); /* rad/s, robot +yaw = CCW */
        /* 1st-order IIR low-pass on the gyro feedback (seeded on the first
         * sample after a reset to avoid a startup transient) so the loop stops
         * chasing the 2-4 Hz self-oscillation. */
        if (!yaw_gyro_filt_valid) {
          yaw_gyro_filt = meas_wz_raw;
          yaw_gyro_filt_valid = 1u;
        } else {
          yaw_gyro_filt += YAW_GYRO_LP_ALPHA * (meas_wz_raw - yaw_gyro_filt);
        }
        const float meas_wz = yaw_gyro_filt;
        const float yaw_err = snap_cmd_wz - meas_wz;
        /* Conditional-integration anti-windup: freeze the integrator only in
         * the direction that would push |trim| further past the clamp (same
         * pattern as the per-wheel loop). Keyed on the RAW (unscaled) trim so
         * the low-speed scaling below doesn't defeat the saturation test. */
        const bool yaw_update_integral =
            !((prev_yaw_trim_mps >= g_yaw_trim_limit_mps && yaw_err > 0.0f) ||
              (prev_yaw_trim_mps <= -g_yaw_trim_limit_mps && yaw_err < 0.0f));
        yaw_pid.setSetpoint(snap_cmd_wz);
        float raw_trim =
            yaw_pid.update(meas_wz, WHEEL_PI_DT_S, yaw_update_integral);
        /* Hard clamp (belt-and-suspenders over the PID output limit) — the
         * differential correction is bounded so a wrong gyro_sign can only veer,
         * never spin unbounded. */
        if (raw_trim > g_yaw_trim_limit_mps)
          raw_trim = g_yaw_trim_limit_mps;
        if (raw_trim < -g_yaw_trim_limit_mps)
          raw_trim = -g_yaw_trim_limit_mps;
        prev_yaw_trim_mps = raw_trim; /* anti-windup uses the unscaled value */

        /* Low-speed integral leak: bleed the integrator toward 0 when authority
         * is de-rated (retain=1.0 at full speed → no leak; approaches
         * YAW_INT_LEAK_AT_FLOOR near the dock) so accumulated bias can't sit and
         * hunt while nearly stopped. */
        const float yaw_int_retain =
            YAW_INT_LEAK_AT_FLOOR +
            (1.0f - YAW_INT_LEAK_AT_FLOOR) * yaw_speed_scale;
        yaw_pid.setIntegral(yaw_pid.getIntegral() * yaw_int_retain);

        /* Apply the low-speed authority scale to the correction actually
         * injected (base rotation is unaffected — it rides the IK feedforward). */
        yaw_trim_mps = raw_trim * yaw_speed_scale;
      }
      /* Slew-rate limit the injected trim (runs even on a gyro-read failure,
       * where yaw_trim_mps is 0, so prev tracks the applied value): the output
       * can't snap across the wheel deadband in one cycle and re-excite the
       * limit-cycle. */
      const float yaw_dtrim = yaw_trim_mps - prev_applied_yaw_trim_mps;
      if (yaw_dtrim > YAW_TRIM_SLEW_MPS_PER_CYCLE)
        yaw_trim_mps = prev_applied_yaw_trim_mps + YAW_TRIM_SLEW_MPS_PER_CYCLE;
      else if (yaw_dtrim < -YAW_TRIM_SLEW_MPS_PER_CYCLE)
        yaw_trim_mps = prev_applied_yaw_trim_mps - YAW_TRIM_SLEW_MPS_PER_CYCLE;
      prev_applied_yaw_trim_mps = yaw_trim_mps;
    } else {
      prev_yaw_trim_mps = 0.0f;
      prev_applied_yaw_trim_mps = 0.0f;
    }

    /* Apply the symmetric differential trim to the per-wheel setpoints
     * (+right / −left increases yaw rate, matching the IK in on_cmd_vel), then
     * re-clamp to the physical wheel-speed limit. hard_stop forces 0. */
    float l_target = snap_left_target - yaw_trim_mps;
    float r_target = snap_right_target + yaw_trim_mps;
    if (hard_stop) {
      l_target = 0.0f;
      r_target = 0.0f;
    }
    const float max_mps = DRIVEMOTOR_GetMaxMps();
    if (l_target > max_mps)
      l_target = max_mps;
    if (l_target < -max_mps)
      l_target = -max_mps;
    if (r_target > max_mps)
      r_target = max_mps;
    if (r_target < -max_mps)
      r_target = -max_mps;

#if USE_WHEEL_PI
    /* Wheel-level PI loop.
     *
     * Reads the signed cumulative encoder count maintained by
     * drivemotor.c, derives actual_mps over the 20 ms loop
     * period, computes a feedforward + PI PWM. The integrator
     * is what bridges the static-friction deadband: while the
     * target says "move 0.05 m/s" and the encoder says "0",
     * Ki × error × dt accumulates until the PWM crosses the
     * deadband (~40), the motor breaks free, the wheel starts
     * counting ticks, error drops, and the integrator settles
     * at whatever PWM keeps that wheel at target speed.
     *
     * Read left_ticks_signed/right_ticks_signed directly (these are
     * 32-bit and updated from the drivemotor rx-decode path —
     * not strictly atomic, but a torn read here costs at most
     * one 20 ms loop of incorrect velocity, then converges). */
    const int32_t cur_left_ticks = left_ticks_signed;
    const int32_t cur_right_ticks = right_ticks_signed;
    const int32_t dleft_ticks = cur_left_ticks - prev_left_ticks_signed_pi;
    const int32_t dright_ticks = cur_right_ticks - prev_right_ticks_signed_pi;
    prev_left_ticks_signed_pi = cur_left_ticks;
    prev_right_ticks_signed_pi = cur_right_ticks;

    const float l_actual_mps =
        ((float)dleft_ticks) / snap_ticks_per_meter / WHEEL_PI_DT_S;
    const float r_actual_mps =
        ((float)dright_ticks) / snap_ticks_per_meter / WHEEL_PI_DT_S;

    /* Reset the integrator on direction reversal / stop-to-go / hard-stop.
     * Without this the integral built up while decelerating would drive the
     * motor backwards as soon as the chassis stopped (micro-oscillation). */
    const bool l_target_sign_changed =
        (l_target * prev_left_target_mps < 0.0f) ||
        (l_target == 0.0f && prev_left_target_mps != 0.0f) || hard_stop;
    const bool r_target_sign_changed =
        (r_target * prev_right_target_mps < 0.0f) ||
        (r_target == 0.0f && prev_right_target_mps != 0.0f) || hard_stop;
    if (l_target_sign_changed) {
      left_wheel_pid.resetIntegral();
      left_wheel_pid.resetDerivative();
    }
    if (r_target_sign_changed) {
      right_wheel_pid.resetIntegral();
      right_wheel_pid.resetDerivative();
    }
    prev_left_target_mps = l_target;
    prev_right_target_mps = r_target;

    /* Conditional-integration anti-windup, DIRECTION-AWARE: freeze the
     * integrator only in the direction that would worsen an already-
     * saturated output; always allow it to unwind OUT of saturation. Keying
     * on the error sign (not just the saturation bit) avoids a one-
     * directional integral latch — e.g. on overspeed (err < 0) while the
     * output is railed high, the integrator must still be able to wind down
     * to cut PWM. *_pwm_signed is the previous cycle's total (feedforward +
     * trim), saturated by DRIVEMOTOR_SetSpeedSigned at ±255. This sits on
     * top of the PID's own ±100 integral-magnitude clamp. */
    const float l_err = l_target - l_actual_mps;
    const float r_err = r_target - r_actual_mps;
    const bool l_update_integral = !((left_pwm_signed >= 255 && l_err > 0.0f) ||
                                     (left_pwm_signed <= -255 && l_err < 0.0f));
    const bool r_update_integral =
        !((right_pwm_signed >= 255 && r_err > 0.0f) ||
          (right_pwm_signed <= -255 && r_err < 0.0f));

    /* Closed-loop PI trim (Kp·err + integrator; D gain = 0). The PID
     * computes error = setpoint − feedback internally and integrates AFTER
     * forming the output (PX4 form), so a fresh integral increment reaches
     * the actuator one 50 Hz cycle later than the old integrate-before form
     * — steady-state identical, ~20 ms transient shift (immaterial here). */
    left_wheel_pid.setSetpoint(l_target);
    right_wheel_pid.setSetpoint(r_target);
    const float l_trim =
        left_wheel_pid.update(l_actual_mps, WHEEL_PI_DT_S, l_update_integral);
    const float r_trim =
        right_wheel_pid.update(r_actual_mps, WHEEL_PI_DT_S, r_update_integral);

    /* Open-loop feedforward (deadband-bridge, preserves the above-deadband
     * mapping) + closed-loop PI trim. Sign carried through. */
    const float l_pwm_f = l_target * g_pwm_per_mps + l_trim;
    const float r_pwm_f = r_target * g_pwm_per_mps + r_trim;

    /* When the target is exactly zero AND we're not braking from a
     * larger speed, force PWM to zero outright — avoids the residual
     * "hum" from a non-zero integral applied to a stopped wheel. */
    left_pwm_signed = (l_target == 0.0f && fabsf(l_actual_mps) < 0.02f)
                          ? 0
                          : (int16_t)l_pwm_f;
    right_pwm_signed = (r_target == 0.0f && fabsf(r_actual_mps) < 0.02f)
                           ? 0
                           : (int16_t)r_pwm_f;

    /* Anti-dig cutout (always active, all modes). The step compares actual
     * travel to the travel the commanded speed implies, using the live
     * ticks_per_meter so both sides of the ratio track calibration.
     * dleft/dright_ticks and left/right_pwm_signed are this cycle's values. */
    if (antidig_step(&l_dig_stall_ms, &l_dig_stall_ticks, &l_dig_exp_ticks,
                     &l_dig_latched, l_target, left_pwm_signed, dleft_ticks,
                     snap_ticks_per_meter)) {
      left_pwm_signed = 0;
      left_wheel_pid.resetIntegral();
    }
    if (antidig_step(&r_dig_stall_ms, &r_dig_stall_ticks, &r_dig_exp_ticks,
                     &r_dig_latched, r_target, right_pwm_signed, dright_ticks,
                     snap_ticks_per_meter)) {
      right_pwm_signed = 0;
      right_wheel_pid.resetIntegral();
    }
#else
    /* Open-loop fallback for bring-up / regression A/B. Replicates the
     * pre-PI mapping exactly: PWM = target × PWM_PER_MPS, no encoder
     * feedback, no integrator. */
    left_pwm_signed = (int16_t)(l_target * g_pwm_per_mps);
    right_pwm_signed = (int16_t)(r_target * g_pwm_per_mps);
#endif

