wjcloudy/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
    if (hard_stop) {
      DRIVEMOTOR_SetSpeedSigned(0, 0);
    } else {
      DRIVEMOTOR_SetSpeedSigned(left_pwm_signed, right_pwm_signed);
    }

    // Heartbeat watchdog: if no heartbeat for HEARTBEAT_TIMEOUT_MS, emergency
    // stop. Tag a PURE comms-loss latch (no physical sensor asserted) so it can
    // be auto-cleared when heartbeats resume (on_heartbeat), instead of
    // stranding the robot. If a physical sensor is asserted, leave the flag
    // cleared so the latch needs an explicit operator release.
    const uint32_t heartbeat_primask = __get_PRIMASK();
    __disable_irq();
    const uint32_t current_heartbeat = last_heartbeat_tick;
    if (current_heartbeat != 0u &&
        (HAL_GetTick() - current_heartbeat) > HEARTBEAT_TIMEOUT_MS) {
      if (any_physical_emergency()) {
        heartbeat_only_latch = false;
      } else if (!Emergency_State()) {
        heartbeat_only_latch = true;
      }
      Emergency_SetState(1);
      target_blade_on_off = 0;
      target_blade_emergency_generation = Emergency_Generation();
      blade_on_off = 0;
    }
    __set_PRIMASK(heartbeat_primask);

    /* Close the interrupt window between the earlier snapshot and the motor
     * request. A new emergency generation, emergency state, IDLE transition,
     * or explicit OFF command must still force this cycle's output OFF. */
    const uint32_t output_primask = __get_PRIMASK();
    __disable_irq();
    const uint32_t output_generation = Emergency_Generation();
    if (Emergency_State() != 0u ||
        main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE ||
        target_blade_on_off == 0u ||
        target_blade_emergency_generation != output_generation) {
      blade_on_off = 0;
    }
    BLADEMOTOR_Set(blade_on_off, blade_direction);
    __set_PRIMASK(output_primask);
  }
}

/* ---------------------------------------------------------------------------
 * Panel handler — button presses generate UI events over COBS
 * ---------------------------------------------------------------------------*/
extern "C" void panel_handler() {
  if (NBT_handler(&panel_nbt)) {
    PANEL_Tick();

    if (buttonupdated == 1 && buttoncleared == 0) {
      const uint32_t ui_event_wire_bytes =
          usb_cdc_framed_packet_size(sizeof(pkt_ui_event_t));
      pkt_ui_event_t evt;
      evt.type = PKT_ID_UI_EVENT;
      evt.press_duration = 0; // short press

      // Map physical buttons to IDs
      if (buttonstate[PANEL_BUTTON_DEF_S1]) {
        evt.button_id = 1;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }
      if (buttonstate[PANEL_BUTTON_DEF_S2]) {
        evt.button_id = 2;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }
      if (buttonstate[PANEL_BUTTON_DEF_LOCK]) {
        evt.button_id = 3;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }
      if (buttonstate[PANEL_BUTTON_DEF_START]) {
        evt.button_id = 4;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }
      if (buttonstate[PANEL_BUTTON_DEF_HOME]) {
        evt.button_id = 5;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }

      buttonupdated = 0;
    }
  }
}

#if OPTION_ULTRASONIC == 1
extern "C" void ultrasonic_handler(void) {
  // USS data is included in the status packet — no separate packet needed.
  // This handler is kept for the main loop call in main.c.
}
#endif

/* ---------------------------------------------------------------------------
 * Wheel ticks handler — called from DRIVEMOTOR_App_Rx() every 20 ms.
 *
 * Builds the odometry packet from signed cumulative ticks. Per-wheel
 * velocity is computed here (not on the Pi) because the firmware has the
 * hardware-timer-accurate dt. All four quantities in the packet are
 * signed; the host doesn't need a direction byte or to re-sign anything.
 * ---------------------------------------------------------------------------*/
extern "C" void
wheelTicks_handler(int32_t p_s32LeftTicksSigned, int32_t p_s32RightTicksSigned,
                   int16_t p_s16LeftSpeed, /* currently unused — reserved for
                                              future telemetry */
                   int16_t p_s16RightSpeed) {
  (void)p_s16LeftSpeed;
  (void)p_s16RightSpeed;

  static int32_t prev_left_ticks = 0;
  static int32_t prev_right_ticks = 0;

  const uint32_t now_tick = HAL_GetTick();
  const uint16_t dt_ms = (uint16_t)(now_tick - last_odom_tick);
  last_odom_tick = now_tick;

  const int32_t delta_left = p_s32LeftTicksSigned - prev_left_ticks;
  const int32_t delta_right = p_s32RightTicksSigned - prev_right_ticks;
  prev_left_ticks = p_s32LeftTicksSigned;
  prev_right_ticks = p_s32RightTicksSigned;

  /* Velocity: mm/s = (delta_ticks / ticks_per_meter) * (1000 / dt_ms) * 1000
   *                = delta_ticks * 1e6 / (ticks_per_meter * dt_ms).
   * ticks_per_meter starts from board.h TICKS_PER_M, then the ROS host can
   * override it at runtime. Use float math here so fractional tuning values
   * (e.g. 319.305) survive end-to-end. */
  int16_t left_v_mm_s = 0;
  int16_t right_v_mm_s = 0;
  if (dt_ms > 0) {
    const float ticks_per_meter = DRIVEMOTOR_GetTicksPerMeter();
    const float scale = 1000000.0f / (ticks_per_meter * (float)dt_ms);
    int32_t v_l = (int32_t)((float)delta_left * scale);
    int32_t v_r = (int32_t)((float)delta_right * scale);
    if (v_l > 32767)
      v_l = 32767;
    if (v_l < -32768)
      v_l = -32768;
    if (v_r > 32767)
      v_r = 32767;
    if (v_r < -32768)
      v_r = -32768;
    left_v_mm_s = (int16_t)v_l;
    right_v_mm_s = (int16_t)v_r;
  }

  pkt_odometry_t odom;
  odom.type = PKT_ID_ODOMETRY;
  odom.dt_millis = dt_ms;
  odom.left_ticks = p_s32LeftTicksSigned;
  odom.right_ticks = p_s32RightTicksSigned;
  odom.left_velocity_mm_s = left_v_mm_s;
  odom.right_velocity_mm_s = right_v_mm_s;

  if (usb_cdc_should_send_telemetry_packet(
          usb_cdc_framed_packet_size(sizeof(pkt_odometry_t)))) {
    mowgli_comms_send_odometry(&odom);
  }
}

/* ---------------------------------------------------------------------------
 * IMU + status broadcast handler
 * ---------------------------------------------------------------------------*/
extern "C" void broadcast_handler() {
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_ENTER);
  const uint32_t now_tick = HAL_GetTick();

